In [2]:
import pandas as pd

#load area_sown.csv and convert wide format â†’ long format
area = pd.read_csv(r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\area_sown.csv")

area.head()

,Province/division\n/district,2007-08,2008-09,2009-10,2010-11,2011-12,2012-13,2013-14,2014-15,2015-16,2016-17,2017-18,2018-19,2019-20
0,PUNJAB,"2,438","2,695","2,592","2,846","2,736","2,854","2,860","2,762","2,824","3,073","2,924","2,829","2,978"
1,Bahawalpur Div.,"2,514","2,854","2,858","3,129","3,069","3,099","3,136","3,120","3,179","3,354","3,088","3,158","3,526"
2,Bahawalnagar,"2,563","2,860","2,992","3,122","2,943","2,984","3,036","3,146","3,052","3,269","3,070","3,244","3,714"
3,Bahawalpur,"2,578","2,996","2,823","3,150","3,195","3,000","3,025","3,047","3,227","3,404","3,224","3,021","3,307"
4,Rahim Yar Khan,"2,401","2,715","2,747","3,119","3,101","3,330","3,369","3,157","3,286","3,416","2,971","3,183","3,491"

In [5]:
area.rename(columns={"Province/division\n/district": "District"}, inplace=True)

In [6]:
area.head()

,District,2007-08,2008-09,2009-10,2010-11,2011-12,2012-13,2013-14,2014-15,2015-16,2016-17,2017-18,2018-19,2019-20
0,PUNJAB,"2,438","2,695","2,592","2,846","2,736","2,854","2,860","2,762","2,824","3,073","2,924","2,829","2,978"
1,Bahawalpur Div.,"2,514","2,854","2,858","3,129","3,069","3,099","3,136","3,120","3,179","3,354","3,088","3,158","3,526"
2,Bahawalnagar,"2,563","2,860","2,992","3,122","2,943","2,984","3,036","3,146","3,052","3,269","3,070","3,244","3,714"
3,Bahawalpur,"2,578","2,996","2,823","3,150","3,195","3,000","3,025","3,047","3,227","3,404","3,224","3,021","3,307"
4,Rahim Yar Khan,"2,401","2,715","2,747","3,119","3,101","3,330","3,369","3,157","3,286","3,416","2,971","3,183","3,491"

In [10]:
area.shape

(47, 14)

In [7]:
#melt into long format (wide year col -> rows)
area_long = area.melt(
    id_vars = ["District"],
    var_name = "YearRange",
    value_name = "Area_Sown"
)

#extract first year from "2007-08"
area_long["Year"] = area_long["YearRange"].str.split("-").str[0].astype(int)

#drop extra
area_long = area_long[["District", "Year", "Area_Sown"]]

In [8]:
area_long.head()

          District  Year Area_Sown
0           PUNJAB  2007     2,438
1  Bahawalpur Div.  2007     2,514
2     Bahawalnagar  2007     2,563
3       Bahawalpur  2007     2,578
4   Rahim Yar Khan  2007     2,401

In [11]:
area_long.shape

(611, 3)

In [ ]:
#load wheat_pct.csv - transform and merge
wheat = pd.read_csv(r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\wheat_pct.csv")

wheat.shape

(47, 14)

In [13]:
wheat.head()

,Province/division\n/district,2007-08,2008-09,2009-10,2010-11,2011-12,2012-13,2013-14,2014-15,2015-16,2016-17,2017-18,2018-19,2019-20
0,PUNJAB,100.00,100.00,100.00,100.00,100.00,100.00,100.00,100.00,100.00,100.00,100.00,100.00,100.00
1,Bahawalpur Div.,14.57,14.90,15.80,15.24,15.29,14.68,14.99,16.04,15.97,15.43,14.97,16.56,18.10
2,Bahawalnagar,5.35,5.37,5.91,5.66,5.58,5.39,5.52,6.02,5.80,5.95,5.91,6.30,7.75
3,Bahawalpur,4.57,4.80,4.80,4.63,4.72,4.28,4.46,4.69,4.96,4.81,4.81,4.69,5.11
4,Rahim Yar Khan,4.65,4.72,5.09,4.95,5.00,5.00,5.01,5.32,5.20,4.66,4.26,5.58,5.24

In [14]:
wheat.rename(columns={"Province/division\n/district": "District"}, inplace=True)

In [15]:
wheat.head()

,District,2007-08,2008-09,2009-10,2010-11,2011-12,2012-13,2013-14,2014-15,2015-16,2016-17,2017-18,2018-19,2019-20
0,PUNJAB,100.00,100.00,100.00,100.00,100.00,100.00,100.00,100.00,100.00,100.00,100.00,100.00,100.00
1,Bahawalpur Div.,14.57,14.90,15.80,15.24,15.29,14.68,14.99,16.04,15.97,15.43,14.97,16.56,18.10
2,Bahawalnagar,5.35,5.37,5.91,5.66,5.58,5.39,5.52,6.02,5.80,5.95,5.91,6.30,7.75
3,Bahawalpur,4.57,4.80,4.80,4.63,4.72,4.28,4.46,4.69,4.96,4.81,4.81,4.69,5.11
4,Rahim Yar Khan,4.65,4.72,5.09,4.95,5.00,5.00,5.01,5.32,5.20,4.66,4.26,5.58,5.24

In [16]:
wheat_long = wheat.melt(
    id_vars = ["District"],
    var_name = "YearRange",
    value_name = "Wheat_Percentage"
)

In [17]:
wheat_long["Year"] = wheat_long["YearRange"].str.split("-").str[0].astype(int)

wheat_long = wheat_long[["District", "Year", "Wheat_Percentage"]]

In [18]:
wheat_long.head()

          District  Year Wheat_Percentage
0           PUNJAB  2007           100.00
1  Bahawalpur Div.  2007            14.57
2     Bahawalnagar  2007             5.35
3       Bahawalpur  2007             4.57
4   Rahim Yar Khan  2007             4.65

In [19]:
wheat_long.shape

(611, 3)

In [21]:
#merge with base table
df = area_long.merge(wheat_long, on=["District", "Year"], how="left")

df.head(10)

            District  Year Area_Sown Wheat_Percentage
0             PUNJAB  2007     2,438           100.00
1    Bahawalpur Div.  2007     2,514            14.57
2       Bahawalnagar  2007     2,563             5.35
3         Bahawalpur  2007     2,578             4.57
4     Rahim Yar Khan  2007     2,401             4.65
5  D.G.Khan Division  2007     2,354              NaN
6           D.G.Khan  2007     2,540             2.83
7             Layyah  2007     2,179             2.74
8       Muzaffargarh  2007     2,372             4.41
9           Rajanpur  2007     2,332             2.14

In [22]:
#merging crop_yield.csv

crop = pd.read_csv(r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\crop_yield.csv")

crop.head()

,ID,Year,State,Crop_Type,Rainfall (mm),Soil_Type,Irrigation_Area (ha),Crop_Yield (kg/ha)
0,1,2006,Punjab,Bajra,300,Loamy,90,2863
1,2,2005,Punjab,Wheat,405,Loamy,104,3132
2,3,2008,Punjab,Wheat,538,Loamy,147,3992
3,4,2018,Punjab,Rice,943,Loamy,107,3067
4,5,2012,Punjab,Rice,977,Loamy,169,3222

In [23]:
crop.shape

(10000, 8)

In [24]:
#keep punjab only (as dataset is punjab only)
crop = crop[crop["State"] == "Punjab"].copy()

In [25]:
crop.head()

,ID,Year,State,Crop_Type,Rainfall (mm),Soil_Type,Irrigation_Area (ha),Crop_Yield (kg/ha)
0,1,2006,Punjab,Bajra,300,Loamy,90,2863
1,2,2005,Punjab,Wheat,405,Loamy,104,3132
2,3,2008,Punjab,Wheat,538,Loamy,147,3992
3,4,2018,Punjab,Rice,943,Loamy,107,3067
4,5,2012,Punjab,Rice,977,Loamy,169,3222

In [ ]:
#keeping relevant columns
crop_small = crop[["Year", "Crop_Yield (kg/ha)", "Irrigation_Area (ha)"]]

#merge
df = df.merge(crop_small, on="Year", how="left")

In [30]:
df.head(15)

,District,Year,Area_Sown,Wheat_Percentage,Crop_Yield (kg/ha),Irrigation_Area (ha)
0,PUNJAB,2007,"2,438",100.00,3186,170
1,PUNJAB,2007,"2,438",100.00,1871,50
2,PUNJAB,2007,"2,438",100.00,3983,151
3,PUNJAB,2007,"2,438",100.00,2591,82
4,PUNJAB,2007,"2,438",100.00,3188,152
5,PUNJAB,2007,"2,438",100.00,2110,86
6,PUNJAB,2007,"2,438",100.00,3175,124
7,PUNJAB,2007,"2,438",100.00,3666,118
8,PUNJAB,2007,"2,438",100.00,2456,58
9,PUNJAB,2007,"2,438",100.00,2870,166
10,PUNJAB,2007,"2,438",100.00,2094,59
11,PUNJAB,2007,"2,438",100.00,3396,139
12,PUNJAB,2007,"2,438",100.00,3199,135
13,PUNJAB,2007,"2,438",100.00,3516,165
14,PUNJAB,2007,"2,438",100.00,2674,133

In [31]:
df.tail(10)

,District,Year,Area_Sown,Wheat_Percentage,Crop_Yield (kg/ha),Irrigation_Area (ha)
292330,Islamabad,2019,"1,618",0.28,2183,63
292331,Islamabad,2019,"1,618",0.28,3158,139
292332,Islamabad,2019,"1,618",0.28,3340,101
292333,Islamabad,2019,"1,618",0.28,2901,75
292334,Islamabad,2019,"1,618",0.28,3350,136
292335,Islamabad,2019,"1,618",0.28,3071,125
292336,Islamabad,2019,"1,618",0.28,3528,108
292337,Islamabad,2019,"1,618",0.28,3710,132
292338,Islamabad,2019,"1,618",0.28,3783,134
292339,Islamabad,2019,"1,618",0.28,3907,170

In [34]:
#merge temperature (temp_pk.csv)
#dataset has monthly temperatures for 1901-2016
#we'll compute annual mean temperature

temp = pd.read_csv(
    r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\temp_pk.csv"
)

temp.head()

   Temperature - (Celsius)   Year     Month
0                  7.72768   1901   January
1                  8.93600   1901  February
2                 16.96320   1901     March
3                 21.27410   1901     April
4                 26.04970   1901       May

In [36]:
temp.columns = temp.columns.str.strip()           #remove spaces
temp.columns = temp.columns.str.replace("\ufeff", "")  #remove BOM
print(temp.columns)

Index(['Temperature - (Celsius)', 'Year', 'Month'], dtype='object')

In [37]:
#converting month+year to datetime
temp["date"] = pd.to_datetime(temp["Year"].astype(str) + "-" + temp["Month"] + "-01", errors="coerce")
temp["Temperature"] = pd.to_numeric(temp["Temperature - (Celsius)"], errors="coerce")

#compute annual avg
temp_yearly = temp.groupby("Year")["Temperature"].mean().reset_index()

temp_yearly.rename(columns={"Temperature": "Avg_Temperature"}, inplace=True)

In [38]:
df = df.merge(temp_yearly, on="Year", how="left")

df.head()

,District,Year,Area_Sown,Wheat_Percentage,Crop_Yield (kg/ha),Irrigation_Area (ha),Avg_Temperature
0,PUNJAB,2007,"2,438",100.00,3186,170,20.618028
1,PUNJAB,2007,"2,438",100.00,1871,50,20.618028
2,PUNJAB,2007,"2,438",100.00,3983,151,20.618028
3,PUNJAB,2007,"2,438",100.00,2591,82,20.618028
4,PUNJAB,2007,"2,438",100.00,3188,152,20.618028

In [40]:
#rainfall yearly average
rain = pd.read_csv(r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\Rain_fall_in_Pakistan.csv")
rain = rain.iloc[1:]    #remove metadata row

#clean column names
rain.columns = rain.columns.str.strip().str.replace("\ufeff", "")

#convert date
rain["date"] = pd.to_datetime(rain["date"], errors="coerce")

#convert rainfall columns to numeric FIXES the string issue
rain_cols = ["rfh", "rfh_avg", "r1h", "r1h_avg", "r3h", "r3h_avg", "rfq", "r1q", "r3q"]

for col in rain_cols:
    rain[col] = pd.to_numeric(rain[col], errors="coerce")

In [41]:
rain.dtypes

date          datetime64[ns]
adm2_id               object
ADM2_PCODE            object
n_pixels              object
rfh                  float64
rfh_avg              float64
r1h                  float64
r1h_avg              float64
r3h                  float64
r3h_avg              float64
rfq                  float64
r1q                  float64
r3q                  float64
version               object
dtype: object

In [42]:
bad = rain[rain["rfh"].astype(str).str.contains(r"\D\d\D", regex=True, na=False)]
bad.head()

Empty DataFrame
Columns: [date, adm2_id, ADM2_PCODE, n_pixels, rfh, rfh_avg, r1h, r1h_avg, r3h, r3h_avg, rfq, r1q, r3q, version]
Index: []

In [43]:
rain["Year"] = rain["date"].dt.year
rain_yearly = rain.groupby("Year")["rfh"].mean().reset_index()
rain_yearly.rename(columns={"rfh": "Avg_Rainfall"}, inplace=True)

In [44]:
df = df.merge(rain_yearly, on="Year", how="left")

df.head(10)

,District,Year,Area_Sown,Wheat_Percentage,Crop_Yield (kg/ha),Irrigation_Area (ha),Avg_Temperature,Avg_Rainfall
0,PUNJAB,2007,"2,438",100.00,3186,170,20.618028,12.383932
1,PUNJAB,2007,"2,438",100.00,1871,50,20.618028,12.383932
2,PUNJAB,2007,"2,438",100.00,3983,151,20.618028,12.383932
3,PUNJAB,2007,"2,438",100.00,2591,82,20.618028,12.383932
4,PUNJAB,2007,"2,438",100.00,3188,152,20.618028,12.383932
5,PUNJAB,2007,"2,438",100.00,2110,86,20.618028,12.383932
6,PUNJAB,2007,"2,438",100.00,3175,124,20.618028,12.383932
7,PUNJAB,2007,"2,438",100.00,3666,118,20.618028,12.383932
8,PUNJAB,2007,"2,438",100.00,2456,58,20.618028,12.383932
9,PUNJAB,2007,"2,438",100.00,2870,166,20.618028,12.383932

In [45]:
df.tail(10)

,District,Year,Area_Sown,Wheat_Percentage,Crop_Yield (kg/ha),Irrigation_Area (ha),Avg_Temperature,Avg_Rainfall
292330,Islamabad,2019,"1,618",0.28,2183,63,NaN,14.093526
292331,Islamabad,2019,"1,618",0.28,3158,139,NaN,14.093526
292332,Islamabad,2019,"1,618",0.28,3340,101,NaN,14.093526
292333,Islamabad,2019,"1,618",0.28,2901,75,NaN,14.093526
292334,Islamabad,2019,"1,618",0.28,3350,136,NaN,14.093526
292335,Islamabad,2019,"1,618",0.28,3071,125,NaN,14.093526
292336,Islamabad,2019,"1,618",0.28,3528,108,NaN,14.093526
292337,Islamabad,2019,"1,618",0.28,3710,132,NaN,14.093526
292338,Islamabad,2019,"1,618",0.28,3783,134,NaN,14.093526
292339,Islamabad,2019,"1,618",0.28,3907,170,NaN,14.093526

In [1]:
import pandas as pd
import numpy as np

rain = pd.read_csv(
    r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\Rain_fall_in_Pakistan.csv"
)

#remove metadata row
rain = rain.iloc[1:].copy()

#parse date
rain["date"] = pd.to_datetime(rain["date"], errors="coerce")

#convert main rainfall columns to numeric
rain_cols = ["rfh", "rfh_avg", "r1h", "r1h_avg", "r3h", "r3h_avg"]
rain[rain_cols] = rain[rain_cols].apply(pd.to_numeric, errors="coerce")

#extract Year for grouping
rain["Year"] = rain["date"].dt.year

#create YEARLY rainfall summary
rain_yearly = (
    rain.groupby("Year")[rain_cols].mean().reset_index()
)

rain_yearly.rename(columns={"rfh": "Avg_Rainfall"}, inplace=True)

rain_yearly.head()

   Year  Avg_Rainfall    rfh_avg        r1h    r1h_avg         r3h     r3h_avg
0  1981     10.816505  10.450099  33.272333  32.202138  105.033264  105.124570
1  1982      9.362878  10.450099  27.940979  31.350301   80.826825   94.050903
2  1983     10.986556  10.450099  33.195766  31.350301  102.657625   94.050903
3  1984     10.490451  10.450099  31.442020  31.350301   93.928316   94.050903
4  1985      8.092990  10.450099  23.415054  31.350301   68.269878   94.050903

In [2]:
rain_yearly.shape

(44, 7)

In [3]:
#(temp_pk.csv)
temp = pd.read_csv(
    r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\temp_pk.csv"
)

#convert month+year â†’ datetime
temp["date"] = pd.to_datetime(
    temp["Year"].astype(str) + "-" + temp["Month"] + "-01",
    errors="coerce"
)

#convert temperature column to numeric
temp["Temperature"] = pd.to_numeric(temp["Temperature - (Celsius)"], errors="coerce")

#extract year
temp["Year"] = temp["date"].dt.year

#compute annual temperature average
temp_yearly = temp.groupby("Year")["Temperature"].mean().reset_index()
temp_yearly.rename(columns={"Temperature": "Avg_Temperature"}, inplace=True)

temp_yearly.head()

   Year  Avg_Temperature
0  1901        20.060848
1  1902        20.406836
2  1903        19.464821
3  1904        19.970376
4  1905        19.448188

In [4]:
temp_yearly.shape

(116, 2)

In [7]:
area = pd.read_csv(
    r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\area_sown.csv"
)

area.rename(columns={"Province/division\n/district": "District"}, inplace=True)

#melt wide data into long format
area_long = area.melt(
    id_vars="District",
    var_name="Year",
    value_name="Area_Sown"
)

#convert Year like "2007-08" â†’ 2007
area_long["Year"] = area_long["Year"].str.split("-").str[0].astype(int)

#clean numeric formatting
area_long["Area_Sown"] = (
    area_long["Area_Sown"]
    .astype(str)
    .str.replace(",", "", regex=False)
    .replace({"**": np.nan, "-": np.nan, "": np.nan})   # <- FIX
)

#some entries may still contain whitespace or weird characters so we force numeric safely
area_long["Area_Sown"] = pd.to_numeric(area_long["Area_Sown"], errors="coerce")

area_long.head()

          District  Year  Area_Sown
0           PUNJAB  2007     2438.0
1  Bahawalpur Div.  2007     2514.0
2     Bahawalnagar  2007     2563.0
3       Bahawalpur  2007     2578.0
4   Rahim Yar Khan  2007     2401.0

In [8]:
area_long.head(10)

            District  Year  Area_Sown
0             PUNJAB  2007     2438.0
1    Bahawalpur Div.  2007     2514.0
2       Bahawalnagar  2007     2563.0
3         Bahawalpur  2007     2578.0
4     Rahim Yar Khan  2007     2401.0
5  D.G.Khan Division  2007     2354.0
6           D.G.Khan  2007     2540.0
7             Layyah  2007     2179.0
8       Muzaffargarh  2007     2372.0
9           Rajanpur  2007     2332.0

In [10]:
wheat = pd.read_csv(
    r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\wheat_pct.csv"
)

wheat.rename(columns={"Province/division\n/district": "District"}, inplace=True)

wheat_long = wheat.melt(
    id_vars="District",
    var_name="Year",
    value_name="Wheat_Percentage"
)

wheat_long["Year"] = wheat_long["Year"].str.split("-").str[0].astype(int)
wheat_long["Wheat_Percentage"] = pd.to_numeric(wheat_long["Wheat_Percentage"], errors="coerce")

wheat_long.head()

          District  Year  Wheat_Percentage
0           PUNJAB  2007            100.00
1  Bahawalpur Div.  2007             14.57
2     Bahawalnagar  2007              5.35
3       Bahawalpur  2007              4.57
4   Rahim Yar Khan  2007              4.65

In [11]:
wheat_long.head(10)

          District  Year  Wheat_Percentage
0           PUNJAB  2007            100.00
1  Bahawalpur Div.  2007             14.57
2     Bahawalnagar  2007              5.35
3       Bahawalpur  2007              4.57
4   Rahim Yar Khan  2007              4.65
5    D.G.Khan Div.  2007             12.11
6         D.G.Khan  2007              2.83
7           Layyah  2007              2.74
8     Muzaffargarh  2007              4.41
9         Rajanpur  2007              2.14

In [15]:
crop = pd.read_csv(
    r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\crop_yield.csv"
)

crop = crop[["Year", "State", "Crop_Yield (kg/ha)", "Irrigation_Area (ha)"]]

crop.rename(columns={
    "State": "District",
    "Crop_Yield (kg/ha)": "Crop_Yield",
    "Irrigation_Area (ha)": "Irrigation_Area"
}, inplace=True)

crop.head(10)

   Year District  Crop_Yield  Irrigation_Area
0  2006   Punjab        2863               90
1  2005   Punjab        3132              104
2  2008   Punjab        3992              147
3  2018   Punjab        3067              107
4  2012   Punjab        3222              169
5  2009   Punjab        3390              159
6  2003   Punjab        3276              109
7  2018   Punjab        3020              103
8  2017   Punjab        2036               69
9  2002   Punjab        3111              130

In [16]:
df = crop.copy()

df = df.merge(area_long, on=["District", "Year"], how="left")
df = df.merge(wheat_long, on=["District", "Year"], how="left")
df = df.merge(temp_yearly, on="Year", how="left")
df = df.merge(rain_yearly[["Year", "Avg_Rainfall"]], on="Year", how="left")

df_final = df.sort_values(["District", "Year"]).reset_index(drop=True)

df_final.head(20)

,Year,District,Crop_Yield,Irrigation_Area,Area_Sown,Wheat_Percentage,Avg_Temperature,Avg_Rainfall
0,2000,Punjab,3420,107,NaN,NaN,20.692856,7.781423
1,2000,Punjab,2766,112,NaN,NaN,20.692856,7.781423
2,2000,Punjab,3901,114,NaN,NaN,20.692856,7.781423
3,2000,Punjab,3583,122,NaN,NaN,20.692856,7.781423
4,2000,Punjab,1876,56,NaN,NaN,20.692856,7.781423
5,2000,Punjab,3367,130,NaN,NaN,20.692856,7.781423
6,2000,Punjab,2942,100,NaN,NaN,20.692856,7.781423
7,2000,Punjab,2909,147,NaN,NaN,20.692856,7.781423
8,2000,Punjab,2049,51,NaN,NaN,20.692856,7.781423
9,2000,Punjab,2942,134,NaN,NaN,20.692856,7.781423
10,2000,Punjab,3084,161,NaN,NaN,20.692856,7.781423
11,2000,Punjab,3896,134,NaN,NaN,20.692856,7.781423
12,2000,Punjab,3965,171,NaN,NaN,20.692856,7.781423
13,2000,Punjab,3429,163,NaN,NaN,20.692856,7.781423
14,2000,Punjab,3009,174,NaN,NaN,20.692856,7.781423
15,2000,Punjab,2122,60,NaN,NaN,20.692856,7.781423
16,2000,Punjab,2387,93,NaN,NaN,20.692856,7.781423
17,2000,Punjab,2915,55,NaN,NaN,20.692856,7.781423
18,2000,Punjab,3167,102,NaN,NaN,20.692856,7.781423
19,2000,Punjab,3817,134,NaN,NaN,20.692856,7.781423

In [18]:
df_final.tail(30)

,Year,District,Crop_Yield,Irrigation_Area,Area_Sown,Wheat_Percentage,Avg_Temperature,Avg_Rainfall
9970,2020,Punjab,2553,51,NaN,NaN,NaN,14.755891
9971,2020,Punjab,2910,63,NaN,NaN,NaN,14.755891
9972,2020,Punjab,2249,83,NaN,NaN,NaN,14.755891
9973,2020,Punjab,1928,91,NaN,NaN,NaN,14.755891
9974,2020,Punjab,2589,60,NaN,NaN,NaN,14.755891
9975,2020,Punjab,2918,130,NaN,NaN,NaN,14.755891
9976,2020,Punjab,3246,144,NaN,NaN,NaN,14.755891
9977,2020,Punjab,2956,69,NaN,NaN,NaN,14.755891
9978,2020,Punjab,2883,136,NaN,NaN,NaN,14.755891
9979,2020,Punjab,3451,174,NaN,NaN,NaN,14.755891
9980,2020,Punjab,3319,109,NaN,NaN,NaN,14.755891
9981,2020,Punjab,2294,71,NaN,NaN,NaN,14.755891
9982,2020,Punjab,3121,138,NaN,NaN,NaN,14.755891
9983,2020,Punjab,3409,144,NaN,NaN,NaN,14.755891
9984,2020,Punjab,2042,95,NaN,NaN,NaN,14.755891
9985,2020,Punjab,3923,112,NaN,NaN,NaN,14.755891
9986,2020,Punjab,2242,87,NaN,NaN,NaN,14.755891
9987,2020,Punjab,3726,147,NaN,NaN,NaN,14.755891
9988,2020,Punjab,2013,72,NaN,NaN,NaN,14.755891
9989,2020,Punjab,2185,50,NaN,NaN,NaN,14.755891
9990,2020,Punjab,2754,91,NaN,NaN,NaN,14.755891
9991,2020,Punjab,2914,106,NaN,NaN,NaN,14.755891
9992,2020,Punjab,3793,103,NaN,NaN,NaN,14.755891
9993,2020,Punjab,2150,54,NaN,NaN,NaN,14.755891
9994,2020,Punjab,2598,53,NaN,NaN,NaN,14.755891
9995,2020,Punjab,3682,119,NaN,NaN,NaN,14.755891
9996,2020,Punjab,3971,129,NaN,NaN,NaN,14.755891
9997,2020,Punjab,3306,103,NaN,NaN,NaN,14.755891
9998,2020,Punjab,3186,137,NaN,NaN,NaN,14.755891
9999,2020,Punjab,3036,153,NaN,NaN,NaN,14.755891

#### **district level**

In [15]:
import pandas as pd
import numpy as np

rain = pd.read_csv(r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\Rain_fall_in_Pakistan.csv")

# remove meta row if present
if rain.iloc[0,0].startswith("#"):
    rain = rain.iloc[1:].copy()

rain['date'] = pd.to_datetime(rain['date'], errors='coerce')
rain['Year'] = rain['date'].dt.year

rain['rfh'] = pd.to_numeric(rain['rfh'], errors='coerce')

# compute annual district rainfall
rain_yearly = (
    rain.groupby(["ADM2_PCODE", "Year"])["rfh"]
        .mean()
        .reset_index()
        .rename(columns={"ADM2_PCODE": "District", "rfh": "Avg_Rainfall"})
)

rain_yearly.head()

  District  Year  Avg_Rainfall
0    PK203  1981      3.423858
1    PK203  1982      6.698594
2    PK203  1983      3.331681
3    PK203  1984      2.419928
4    PK203  1985      2.637431

In [16]:
rain_yearly.head(10)

  District  Year  Avg_Rainfall
0    PK203  1981      3.423858
1    PK203  1982      6.698594
2    PK203  1983      3.331681
3    PK203  1984      2.419928
4    PK203  1985      2.637431
5    PK203  1986      2.657394
6    PK203  1987      2.810428
7    PK203  1988      3.055322
8    PK203  1989      3.025525
9    PK203  1990      3.990772

In [14]:
import numpy as np

area = pd.read_csv(r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\area_sown.csv")
area.rename(columns={"Province/division\n/district": "District"}, inplace=True)

area_long = area.melt(
    id_vars="District",
    var_name="Year",
    value_name="Area_Sown"
)

# clean year and values
area_long["Year"] = area_long["Year"].str.split("-").str[0].astype(int)
area_long["Area_Sown"] = (
    area_long["Area_Sown"]
    .astype(str)
    .str.replace(",", "", regex=False)
    .replace({"**": np.nan, "-": np.nan})
    .astype(float)
)

area.head()

,District,2007-08,2008-09,2009-10,2010-11,2011-12,2012-13,2013-14,2014-15,2015-16,2016-17,2017-18,2018-19,2019-20
0,PUNJAB,"2,438","2,695","2,592","2,846","2,736","2,854","2,860","2,762","2,824","3,073","2,924","2,829","2,978"
1,Bahawalpur Div.,"2,514","2,854","2,858","3,129","3,069","3,099","3,136","3,120","3,179","3,354","3,088","3,158","3,526"
2,Bahawalnagar,"2,563","2,860","2,992","3,122","2,943","2,984","3,036","3,146","3,052","3,269","3,070","3,244","3,714"
3,Bahawalpur,"2,578","2,996","2,823","3,150","3,195","3,000","3,025","3,047","3,227","3,404","3,224","3,021","3,307"
4,Rahim Yar Khan,"2,401","2,715","2,747","3,119","3,101","3,330","3,369","3,157","3,286","3,416","2,971","3,183","3,491"

In [2]:
import pandas as pd

wheat = pd.read_csv(r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\wheat_pct.csv")
wheat.rename(columns={"Province/division\n/district": "District"}, inplace=True)

wheat_long = wheat.melt(
    id_vars="District",
    var_name="Year",
    value_name="Wheat_Percentage"
)

wheat_long["Year"] = wheat_long["Year"].str.split("-").str[0].astype(int)
wheat_long["Wheat_Percentage"] = pd.to_numeric(wheat_long["Wheat_Percentage"], errors="coerce")

In [6]:
wheat_long.head(10)

          District  Year  Wheat_Percentage
0           PUNJAB  2007            100.00
1  Bahawalpur Div.  2007             14.57
2     Bahawalnagar  2007              5.35
3       Bahawalpur  2007              4.57
4   Rahim Yar Khan  2007              4.65
5    D.G.Khan Div.  2007             12.11
6         D.G.Khan  2007              2.83
7           Layyah  2007              2.74
8     Muzaffargarh  2007              4.41
9         Rajanpur  2007              2.14

In [7]:
wheat_long.tail(10)

          District  Year  Wheat_Percentage
601   Sahiwal Div.  2019              6.43
602        Sahiwal  2019              1.95
603          Okara  2019              2.61
604      Pakpattan  2019              1.87
605  Sargodha Div.  2019              8.84
606        Bhakkar  2019              2.30
607        Khushab  2019              1.23
608       Mianwali  2019              2.43
609       Sargodha  2019              2.88
610      Islamabad  2019              0.28

In [8]:
temp = pd.read_csv(r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\temp_pk.csv")

temp["Temperature"] = pd.to_numeric(temp["Temperature - (Celsius)"], errors='coerce')
temp["Year"] = temp["Year"].astype(int)

temp_yearly = (
    temp.groupby("Year")["Temperature"]
        .mean()
        .reset_index()
        .rename(columns={"Temperature": "Avg_Temperature"})
)

temp_yearly.head()

   Year  Avg_Temperature
0  1901        20.060848
1  1902        20.406836
2  1903        19.464821
3  1904        19.970376
4  1905        19.448188

In [9]:
temp_yearly.tail(10)

     Year  Avg_Temperature
106  2007        20.618028
107  2008        20.514409
108  2009        20.910592
109  2010        20.999923
110  2011        20.724895
111  2012        20.053536
112  2013        20.652717
113  2014        20.527868
114  2015        20.559059
115  2016        21.414617

In [10]:
crop = pd.read_csv(r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\crop_yield.csv")
crop = crop[crop["State"] == "Punjab"].copy()

crop_small = crop[["Year", "Crop_Yield (kg/ha)", "Irrigation_Area (ha)"]]
crop_small = crop_small.rename(columns={
    "Crop_Yield (kg/ha)": "Crop_Yield",
    "Irrigation_Area (ha)": "Irrigation_Area"
})

crop_small.head()

   Year  Crop_Yield  Irrigation_Area
0  2006        2863               90
1  2005        3132              104
2  2008        3992              147
3  2018        3067              107
4  2012        3222              169

In [11]:
crop_small.tail(10)

      Year  Crop_Yield  Irrigation_Area
9990  2003        2486               77
9991  2017        2091               64
9992  2015        2068               59
9993  2011        2332               50
9994  2006        3677              174
9995  2002        2577              133
9996  2014        3836              142
9997  2015        3120              152
9998  2003        3087              113
9999  2001        3045              126

In [17]:
df = rain_yearly.copy()

df = df.merge(area_long, on=["District", "Year"], how="left")
df = df.merge(wheat_long, on=["District", "Year"], how="left")
df = df.merge(temp_yearly, on="Year", how="left")
df = df.merge(crop_small, on="Year", how="left")

df.head()

,District,Year,Avg_Rainfall,Area_Sown,Wheat_Percentage,Avg_Temperature,Crop_Yield,Irrigation_Area
0,PK203,1981,3.423858,NaN,NaN,20.206408,NaN,NaN
1,PK203,1982,6.698594,NaN,NaN,19.510198,NaN,NaN
2,PK203,1983,3.331681,NaN,NaN,19.611718,NaN,NaN
3,PK203,1984,2.419928,NaN,NaN,19.920437,NaN,NaN
4,PK203,1985,2.637431,NaN,NaN,20.242908,NaN,NaN

In [18]:
df.tail(20)

,District,Year,Avg_Rainfall,Area_Sown,Wheat_Percentage,Avg_Temperature,Crop_Yield,Irrigation_Area
300670,PK726,2020,12.421911,NaN,NaN,NaN,2042.0,95.0
300671,PK726,2020,12.421911,NaN,NaN,NaN,3923.0,112.0
300672,PK726,2020,12.421911,NaN,NaN,NaN,2242.0,87.0
300673,PK726,2020,12.421911,NaN,NaN,NaN,3726.0,147.0
300674,PK726,2020,12.421911,NaN,NaN,NaN,2013.0,72.0
300675,PK726,2020,12.421911,NaN,NaN,NaN,2185.0,50.0
300676,PK726,2020,12.421911,NaN,NaN,NaN,2754.0,91.0
300677,PK726,2020,12.421911,NaN,NaN,NaN,2914.0,106.0
300678,PK726,2020,12.421911,NaN,NaN,NaN,3793.0,103.0
300679,PK726,2020,12.421911,NaN,NaN,NaN,2150.0,54.0
300680,PK726,2020,12.421911,NaN,NaN,NaN,2598.0,53.0
300681,PK726,2020,12.421911,NaN,NaN,NaN,3682.0,119.0
300682,PK726,2020,12.421911,NaN,NaN,NaN,3971.0,129.0
300683,PK726,2020,12.421911,NaN,NaN,NaN,3306.0,103.0
300684,PK726,2020,12.421911,NaN,NaN,NaN,3186.0,137.0
300685,PK726,2020,12.421911,NaN,NaN,NaN,3036.0,153.0
300686,PK726,2021,8.111194,NaN,NaN,NaN,NaN,NaN
300687,PK726,2022,13.480117,NaN,NaN,NaN,NaN,NaN
300688,PK726,2023,8.965433,NaN,NaN,NaN,NaN,NaN
300689,PK726,2024,7.396167,NaN,NaN,NaN,NaN,NaN

In [20]:
df = df.sort_values(["District", "Year"]).reset_index(drop=True)

df.head(30)

,District,Year,Avg_Rainfall,Area_Sown,Wheat_Percentage,Avg_Temperature,Crop_Yield,Irrigation_Area
0,PK203,1981,3.423858,NaN,NaN,20.206408,NaN,NaN
1,PK203,1982,6.698594,NaN,NaN,19.510198,NaN,NaN
2,PK203,1983,3.331681,NaN,NaN,19.611718,NaN,NaN
3,PK203,1984,2.419928,NaN,NaN,19.920437,NaN,NaN
4,PK203,1985,2.637431,NaN,NaN,20.242908,NaN,NaN
5,PK203,1986,2.657394,NaN,NaN,19.578993,NaN,NaN
6,PK203,1987,2.810428,NaN,NaN,20.427150,NaN,NaN
7,PK203,1988,3.055322,NaN,NaN,20.858067,NaN,NaN
8,PK203,1989,3.025525,NaN,NaN,19.541077,NaN,NaN
9,PK203,1990,3.990772,NaN,NaN,20.353342,NaN,NaN
10,PK203,1991,3.493017,NaN,NaN,19.842869,NaN,NaN
11,PK203,1992,3.450828,NaN,NaN,19.705822,NaN,NaN
12,PK203,1993,2.821083,NaN,NaN,20.407645,NaN,NaN
13,PK203,1994,2.758992,NaN,NaN,20.111693,NaN,NaN
14,PK203,1995,3.122522,NaN,NaN,19.943789,NaN,NaN
15,PK203,1996,2.652350,NaN,NaN,19.859887,NaN,NaN
16,PK203,1997,3.242208,NaN,NaN,19.444739,NaN,NaN
17,PK203,1998,3.081150,NaN,NaN,20.465837,NaN,NaN
18,PK203,1999,3.218039,NaN,NaN,20.855873,NaN,NaN
19,PK203,2000,1.972103,NaN,NaN,20.692856,3420.0,107.0
20,PK203,2000,1.972103,NaN,NaN,20.692856,2766.0,112.0
21,PK203,2000,1.972103,NaN,NaN,20.692856,3901.0,114.0
22,PK203,2000,1.972103,NaN,NaN,20.692856,3583.0,122.0
23,PK203,2000,1.972103,NaN,NaN,20.692856,1876.0,56.0
24,PK203,2000,1.972103,NaN,NaN,20.692856,3367.0,130.0
25,PK203,2000,1.972103,NaN,NaN,20.692856,2942.0,100.0
26,PK203,2000,1.972103,NaN,NaN,20.692856,2909.0,147.0
27,PK203,2000,1.972103,NaN,NaN,20.692856,2049.0,51.0
28,PK203,2000,1.972103,NaN,NaN,20.692856,2942.0,134.0
29,PK203,2000,1.972103,NaN,NaN,20.692856,3084.0,161.0

In [21]:
df.tail(30)

,District,Year,Avg_Rainfall,Area_Sown,Wheat_Percentage,Avg_Temperature,Crop_Yield,Irrigation_Area
300660,PK726,2020,12.421911,NaN,NaN,NaN,2589.0,60.0
300661,PK726,2020,12.421911,NaN,NaN,NaN,2918.0,130.0
300662,PK726,2020,12.421911,NaN,NaN,NaN,3246.0,144.0
300663,PK726,2020,12.421911,NaN,NaN,NaN,2956.0,69.0
300664,PK726,2020,12.421911,NaN,NaN,NaN,2883.0,136.0
300665,PK726,2020,12.421911,NaN,NaN,NaN,3451.0,174.0
300666,PK726,2020,12.421911,NaN,NaN,NaN,3319.0,109.0
300667,PK726,2020,12.421911,NaN,NaN,NaN,2294.0,71.0
300668,PK726,2020,12.421911,NaN,NaN,NaN,3121.0,138.0
300669,PK726,2020,12.421911,NaN,NaN,NaN,3409.0,144.0
300670,PK726,2020,12.421911,NaN,NaN,NaN,2042.0,95.0
300671,PK726,2020,12.421911,NaN,NaN,NaN,3923.0,112.0
300672,PK726,2020,12.421911,NaN,NaN,NaN,2242.0,87.0
300673,PK726,2020,12.421911,NaN,NaN,NaN,3726.0,147.0
300674,PK726,2020,12.421911,NaN,NaN,NaN,2013.0,72.0
300675,PK726,2020,12.421911,NaN,NaN,NaN,2185.0,50.0
300676,PK726,2020,12.421911,NaN,NaN,NaN,2754.0,91.0
300677,PK726,2020,12.421911,NaN,NaN,NaN,2914.0,106.0
300678,PK726,2020,12.421911,NaN,NaN,NaN,3793.0,103.0
300679,PK726,2020,12.421911,NaN,NaN,NaN,2150.0,54.0
300680,PK726,2020,12.421911,NaN,NaN,NaN,2598.0,53.0
300681,PK726,2020,12.421911,NaN,NaN,NaN,3682.0,119.0
300682,PK726,2020,12.421911,NaN,NaN,NaN,3971.0,129.0
300683,PK726,2020,12.421911,NaN,NaN,NaN,3306.0,103.0
300684,PK726,2020,12.421911,NaN,NaN,NaN,3186.0,137.0
300685,PK726,2020,12.421911,NaN,NaN,NaN,3036.0,153.0
300686,PK726,2021,8.111194,NaN,NaN,NaN,NaN,NaN
300687,PK726,2022,13.480117,NaN,NaN,NaN,NaN,NaN
300688,PK726,2023,8.965433,NaN,NaN,NaN,NaN,NaN
300689,PK726,2024,7.396167,NaN,NaN,NaN,NaN,NaN

In [22]:
df.shape

(300690, 8)

In [29]:
df_2015 = df[df["Year"] == 2015]

df_2015.head(20)

,District,Year,Avg_Rainfall,Area_Sown,Wheat_Percentage,Avg_Temperature,Crop_Yield,Irrigation_Area
7139,PK203,2015,2.912392,NaN,NaN,20.559059,3357.0,151.0
7140,PK203,2015,2.912392,NaN,NaN,20.559059,3308.0,102.0
7141,PK203,2015,2.912392,NaN,NaN,20.559059,3493.0,144.0
7142,PK203,2015,2.912392,NaN,NaN,20.559059,2760.0,122.0
7143,PK203,2015,2.912392,NaN,NaN,20.559059,2857.0,127.0
7144,PK203,2015,2.912392,NaN,NaN,20.559059,3443.0,164.0
7145,PK203,2015,2.912392,NaN,NaN,20.559059,2990.0,61.0
7146,PK203,2015,2.912392,NaN,NaN,20.559059,2639.0,100.0
7147,PK203,2015,2.912392,NaN,NaN,20.559059,3478.0,112.0
7148,PK203,2015,2.912392,NaN,NaN,20.559059,2961.0,57.0
7149,PK203,2015,2.912392,NaN,NaN,20.559059,2668.0,132.0
7150,PK203,2015,2.912392,NaN,NaN,20.559059,3018.0,166.0
7151,PK203,2015,2.912392,NaN,NaN,20.559059,3514.0,177.0
7152,PK203,2015,2.912392,NaN,NaN,20.559059,3531.0,162.0
7153,PK203,2015,2.912392,NaN,NaN,20.559059,2784.0,174.0
7154,PK203,2015,2.912392,NaN,NaN,20.559059,2102.0,59.0
7155,PK203,2015,2.912392,NaN,NaN,20.559059,2831.0,50.0
7156,PK203,2015,2.912392,NaN,NaN,20.559059,3080.0,117.0
7157,PK203,2015,2.912392,NaN,NaN,20.559059,3418.0,120.0
7158,PK203,2015,2.912392,NaN,NaN,20.559059,3010.0,132.0

In [30]:
df["District"].unique()

array(['PK203', 'PK204', 'PK209', 'PK211', 'PK215', 'PK230', 'PK401',
       'PK508', 'PK509', 'PK514', 'PK516', 'PK519', 'PK523', 'PK526',
       'PK530', 'PK601', 'PK603', 'PK604', 'PK609', 'PK612', 'PK614',
       'PK626', 'PK629', 'PK636', 'PK708', 'PK709', 'PK711', 'PK714',
       'PK718', 'PK726'], dtype=object)

In [32]:
df.to_csv(r"C:\Ibrahim\Personal\University Stuff\Machine Learning\Project\ML Irrigation Project\data\raw\final_district_dataset.csv", index=False)